---
kind: method
id: M:Autodesk.Revit.DB.Electrical.PanelScheduleSheetInstance.GetSchedule
source: html/13e276fc-7ce3-ec0e-2667-6f8c38cd3865.htm
---
# Autodesk.Revit.DB.Electrical.PanelScheduleSheetInstance.GetSchedule Method

Gets the panel schedule view.

## Syntax (C#)
```csharp
public PanelScheduleView GetSchedule()
```

## Returns
The panel schedule view element.